# Pandas - Cont...

In [ ]:
# dropping missing columns/rows, filling the same

In [ ]:
# Joining & grouping Dataframes

In [1]:
import pandas as pd
import numpy as np

In [2]:
dates = pd.date_range(start ='1-1-2018', periods=10, freq='D')
dates

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08',
               '2018-01-09', '2018-01-10'],
              dtype='datetime64[ns]', freq='D')

In [3]:
df = pd.DataFrame(np.random.randn(10, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2018-01-01  0.326439  0.103654  0.176523  0.329841
2018-01-02  1.082808 -0.664687 -1.323068  0.920372
2018-01-03  0.633644 -1.208015 -0.982830 -1.235419
2018-01-04 -1.385204  0.303840 -0.573832 -0.356134
2018-01-05  3.250725  0.130431  0.336580 -0.101148
2018-01-06  0.063677 -0.531228  0.437914  0.467127
2018-01-07  0.957229 -0.967360 -0.458420  1.389346
2018-01-08 -0.355152 -0.484446  1.355908 -1.654975
2018-01-09  1.229896 -1.610577  1.562983  0.453524
2018-01-10 -0.780622  0.366239  1.625432  2.355114

In [16]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1], 'E'] = 1
df1

                   A         B         C         D    E
2018-01-01  0.326439  0.103654  0.176523  0.329841  1.0
2018-01-02  1.082808 -0.664687 -1.323068  0.920372  1.0
2018-01-03  0.633644 -1.208015 -0.982830 -1.235419  NaN
2018-01-04 -1.385204  0.303840 -0.573832 -0.356134  NaN

In [9]:
# dropping any missing values
df1.dropna(how='any', axis = 0, inplace = True) #all

In [10]:
df1

                   A         B         C         D    E
2018-01-01  0.326439  0.103654  0.176523  0.329841  1.0
2018-01-02  1.082808 -0.664687 -1.323068  0.920372  1.0

In [12]:
# dropping any missing values
df1.dropna(how='all', axis = 0, inplace = True) #all

In [13]:
df1

                   A         B         C         D    E
2018-01-01  0.326439  0.103654  0.176523  0.329841  1.0
2018-01-02  1.082808 -0.664687 -1.323068  0.920372  1.0
2018-01-03  0.633644 -1.208015 -0.982830 -1.235419  NaN
2018-01-04 -1.385204  0.303840 -0.573832 -0.356134  NaN

In [14]:
np.mean(df1['D'])

-0.0853351973778745

In [15]:
# filling missing values
df1.fillna(np.mean(df1['E']))

                   A         B         C         D    E
2018-01-01  0.326439  0.103654  0.176523  0.329841  1.0
2018-01-02  1.082808 -0.664687 -1.323068  0.920372  1.0
2018-01-03  0.633644 -1.208015 -0.982830 -1.235419  1.0
2018-01-04 -1.385204  0.303840 -0.573832 -0.356134  1.0

In [27]:
# filling missing values
df1.fillna(np.median(df1.iloc[:2, 4]))

                   A         B         C         D    E
2018-01-01  0.326439  0.103654  0.176523  0.329841  1.0
2018-01-02  1.082808 -0.664687 -1.323068  0.920372  1.0
2018-01-03  0.633644 -1.208015 -0.982830 -1.235419  1.0
2018-01-04 -1.385204  0.303840 -0.573832 -0.356134  1.0

In [22]:
np.median(df1.iloc[:2, 4])

1.0

# Joins

In [29]:
df =  pd.DataFrame(np.random.randint(1,10,(10,4)))
df

   0  1  2  3
0  7  8  7  6
1  3  5  2  8
2  7  1  6  4
3  2  7  5  4
4  8  2  7  4
5  3  8  1  4
6  1  5  6  1
7  6  2  1  4
8  5  6  8  4
9  6  3  5  1

In [30]:
students = {1:"Tipu", 2: 'Geetha', 3:'Poojitha', 4:'Vinod', 5:'Nithya'}
students

{1: 'Tipu', 2: 'Geetha', 3: 'Poojitha', 4: 'Vinod', 5: 'Nithya'}

In [34]:
df = pd.DataFrame(students, index = list('A'))
df

      1       2         3      4       5
A  Tipu  Geetha  Poojitha  Vinod  Nithya

In [43]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'nar'], 'rval': [3, 4]})
print(left)
print('\n----------')
print(right)

   key  lval
0  foo     1
1  bar     2

----------
   key  rval
0  foo     3
1  nar     4

In [40]:
pd.merge(left, right, how = "inner",  on = "key")

   key  lval  rval
0  foo     1     3

In [44]:
pd.merge(left, right, how = "left",  on = "key")

   key  lval  rval
0  foo     1   3.0
1  bar     2   NaN

In [45]:
pd.merge(left, right, how = "right",  on = "key")

   key  lval  rval
0  foo   1.0     3
1  nar   NaN     4

In [46]:
pd.merge(left, right, how = "outer",  on = "key")

   key  lval  rval
0  foo   1.0   3.0
1  bar   2.0   NaN
2  nar   NaN   4.0

In [48]:
orders = pd.read_excel(r'C:\Users\91965\Documents\Besant\Tableau\Ex_Files_Tableau10_EssT_Update\Exercise Files\Chapter10\PropertyOrderProduct.xlsx', sheet_name = "OrderDetails")
products = pd.read_excel(r'C:\Users\91965\Documents\Besant\Tableau\Ex_Files_Tableau10_EssT_Update\Exercise Files\Chapter10\PropertyOrderProduct.xlsx', sheet_name = "Products")

In [49]:
orders.columns

Index(['OrderID', 'OrderDate', 'PropertyID', 'ProductID', 'Quantity'], dtype='object')

In [50]:
products.columns

Index(['ProductID', 'ProductName', 'ProductCategory', 'Price'], dtype='object')

In [51]:
orders.head()

   OrderID  OrderDate  PropertyID  ProductID  Quantity
0        1 2015-01-01          17         41         1
1        2 2015-01-01          15         54         2
2        3 2015-01-01           5         71         2
3        4 2015-01-01          19          3         2
4        5 2015-01-01          12         45         3

In [52]:
products.head()

   ProductID  ProductName ProductCategory  Price
0          1  Large Towel    Housekeeping      9
1          2   Hand Towel    Housekeeping      5
2          3    Washcloth    Housekeeping      3
3          4      Shampoo    Housekeeping     40
4          5  Moisturizer    Housekeeping     40

In [55]:
total_values = pd.merge(orders, products, how  = 'inner', on = 'ProductID')
total_values.tail(5)

,OrderID,OrderDate,PropertyID,ProductID,Quantity,ProductName,ProductCategory,Price
4995,4872,2016-12-08,8,32,3,Note Pads,Office Supplies,14
4996,4876,2016-12-08,4,32,3,Note Pads,Office Supplies,14
4997,4892,2016-12-12,18,32,2,Note Pads,Office Supplies,14
4998,4897,2016-12-13,1,32,1,Note Pads,Office Supplies,14
4999,4990,2016-12-30,10,32,1,Note Pads,Office Supplies,14

In [41]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'key1': ['foo', 'nar'], 'rval': [3, 4]})
print(left)
print('\n----------')
print(right)

   key  lval
0  foo     1
1  bar     2

----------
  key1  rval
0  foo     3
1  nar     4

In [42]:
pd.merge(left, right, how = "inner",  left_on = "key", right_on = "key1")

   key  lval key1  rval
0  foo     1  foo     3

# Group by

In [56]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
                    'B': ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
                    'C': np.random.randn(8),
                    'D': np.random.randn(8)})
df

     A      B         C         D
0  foo    one -0.736884  1.409198
1  bar    one  0.789736  0.185847
2  foo    two  1.533124  0.748005
3  bar  three -0.330078  0.188267
4  foo    two -0.298113  0.553769
5  bar    two -1.260295  0.215544
6  foo    one  1.335518 -1.569638
7  foo  three  1.484569 -0.092192

In [57]:
df.groupby('A').sum()

            C         D
A
bar -0.800637  0.589658
foo  3.318215  1.049141

In [58]:
df.groupby('A').count()

     B  C  D
A
bar  3  3  3
foo  5  5  5

In [59]:
df.groupby('A').mean()

            C         D
A
bar -0.266879  0.196553
foo  0.663643  0.209828

In [61]:
df.groupby('A')['C'].sum()

A
bar   -0.800637
foo    3.318215
Name: C, dtype: float64

In [63]:
df.groupby(['A', 'B'])['C'].sum()

A    B
bar  one      0.789736
     three   -0.330078
     two     -1.260295
foo  one      0.598634
     three    1.484569
     two      1.235012
Name: C, dtype: float64

In [64]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one    0.789736  0.185847
    three -0.330078  0.188267
    two   -1.260295  0.215544
foo one    0.598634 -0.160441
    three  1.484569 -0.092192
    two    1.235012  1.301774

# Functions

In [65]:
def first_function():
    pass

In [66]:
first_function()

In [67]:
def my_function():
  print("Hello from a function")

In [68]:
my_function()

Hello from a function

In [69]:
my_function()

Hello from a function

In [70]:
def add(x, y):
    return x + y

add(10,15)

25

In [88]:
def add():
#     global t, l
    t = int(input('Enter a Number:'))
    l = int(input('Enter a Number:'))
    return t + l

In [102]:
def add():
#     global t, l
    g, h = 10, 15
    return g + h

In [104]:
add()

25

In [103]:
g

NameError: name 'g' is not defined

In [89]:
add()

Enter a Number:15
Enter a Number:15

30

In [91]:
def my_function(fname, lname):
  print(fname + " " + lname)

my_function("Gowtham", "Kumar")

Gowtham Kumar

In [92]:
my_function("Gowtham")

TypeError: my_function() missing 1 required positional argument: 'lname'

In [93]:
def greet(name, msg):
    """This function greets to
    the person with the provided message"""
    print("Hello", name + ', ' + msg)

greet("Monica", "Good morning!")

Hello Monica, Good morning!

In [95]:
greet.__doc__

'This function greets to\n    the person with the provided message'

In [96]:
def greet(name, msg="Good morning!"):
    """
    This function greets to
    the person with the
    provided message.

    If the message is not provided,
    it defaults to "Good
    morning!"
    """

    print("Hello", name + ', ' + msg)


greet("Kate")
greet("Bruce", "How do you do?")
greet("Lee", msg = "Where are you?")

Hello Kate, Good morning!
Hello Bruce, How do you do?
Hello Lee, Where are you?

In [97]:
def sign(x):
    if x > 0:
        return 'positive'
    elif x < 0:
        return 'negative'
    else:
        return 'zero'

for x in [-1, 0, 1]:
    print(sign(x))

negative
zero
positive

In [99]:
def hello(name, loud=False):
    if loud:
        print ('HELLO, %s' % name.upper())
    else:
        print ('Hello, %s!' % name)

hello('Bob', loud = True)
hello('Fred')

HELLO, BOB
Hello, Fred!

In [ ]:
def greet(*names):
    """This function greets all
    the person in the names tuple."""

    # names is a tuple with arguments
    for name in names:
        print("Hello", name)


greet("Monica", "Luke", "Steve", "John")

In [ ]:
def my_function(*kids):
  print("The youngest child is " + kids[2])

my_function("Emil", "Tobias", "Linus")

In [ ]:
def my_function(child3, child2, child1):
  print("The youngest child is " + child3)

my_function(child1 = "Emil", child2 = "Tobias", child3 = "Linus")

In [ ]:
def my_function(**kid):
  print("His last name is " + kid["lname"])

my_function(fname = "Tobias", lname = "Refsnes")

In [ ]:
def my_function(food):
  for x in food:
    print(x)

fruits = ["apple", "banana", "cherry"]

my_function(fruits)

# Scope

In [ ]:
def sum( arg1, arg2 ):
   # Add both the parameters and return them."
   total = arg1 + arg2; # Here total is local variable.
   print ("Inside the function local total : ", total)
   return total

# Now you can call sum function
sum(10, 20);
print ("Outside the function global total : ", total)

#### ACTIVITY:
Define a function which would take a number 'n' as input and compute the sum of natural numbers till n.
Example if input number is 5, the function returns the result: 1+2+3+4+5

HINT: You can use the shortcut formula n(n+1)/2.
So for n = 5, result = 5*6/2 = 15

#### ACTIVITY:
Write a function 'F' which would take in two numbers. Based on user choice 1 == add the numbers or 2 == multiply the two numbers, perform the operation and return the appropriate results

# Lambda

In [ ]:
# Lambda Function

adder = lambda x, y: x + y
print (adder (1, 2))

In [ ]:
x = lambda x,y : x + y
print(x(5,10))

In [ ]:
x = lambda a, b, c : a + b + c
print(x(5, 6, 2))

In [ ]:
(lambda x: x + 1)(2)

In [ ]:
# Lambda with a Filter

sequences = [10,2,8,7,5,4,3,11,0, 1]
filtered_result = filter (lambda x: x > 4, sequences) 
print(list(filtered_result))

In [ ]:
my_list = [1, 5, 4, 6, 8, 11, 3, 12]

new_list = list(filter(lambda x: (x%2 == 0) , my_list))

print(new_list)

In [ ]:
sequences = 10,15
filtered_result = (lambda x: x*x)(sequences)
print(tuple(filtered_result))

In [ ]:
# lambdas in map()

sequences = [10,2,8,7,5,4,3,11,0, 1]
filtered_result = map (lambda x: x*x, sequences) 
print(list(filtered_result))

In [ ]:
animals = ['dog', 'cat', 'parrot', 'rabbit'] 
  
uppered_animals = list(map(lambda animal: str.upper(animal), animals)) 
uppered_animals

In [ ]:
from functools import reduce
li = [5, 8, 10, 20, 50, 100] 
a = reduce((lambda x, y: x + y), li) 
print (a)

In [ ]:
lis = [ 1 , 3, 5, 6, 2, ]  
print (reduce(lambda a,b : a if a > b else b,lis))